dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDam_bf.h
/** \brief Mask for Ifx_DAM_ACCEN1_Bits.EN58 */
#define IFX_DAM_ACCEN1_EN58_MSK (0x1u)

/** \brief Offset for Ifx_DAM_ACCEN1_Bits.EN58 */
#define IFX_DAM_ACCEN1_EN58_OFF (26u)

/** \brief Length for Ifx_DAM_ACCEN1_Bits.EN59 */
#define IFX_DAM_ACCEN1_EN59_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN1_Bits.EN59 */
#define IFX_DAM_ACCEN1_EN59_MSK (0x1u)

/** \brief Offset for Ifx_DAM_ACCEN1_Bits.EN59 */
#define IFX_DAM_ACCEN1_EN59_OFF (27u)

/** \brief Length for Ifx_DAM_ACCEN1_Bits.EN60 */
#define IFX_DAM_ACCEN1_EN60_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN1_Bits.EN60 */
#define IFX_DAM_ACCEN1_EN60_MSK (0x1u)

/** \brief Offset for Ifx_DAM_ACCEN1_Bits.EN60 */
#define IFX_DAM_ACCEN1_EN60_OFF (28u)

/** \brief Length for Ifx_DAM_ACCEN1_Bits.EN61 */
#define IFX_DAM_ACCEN1_EN61_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN1_Bits.EN61 */
#define IFX_DAM_ACCEN1_EN61_MSK (0x1u)

/** \brief Offset for Ifx_DAM_ACCEN1_Bits.EN61 */
#define IFX_DAM_ACCEN1_EN61_OFF (29u)

/** \brief Length for Ifx_DAM_ACCEN1_Bits.EN62 */
#define IFX_DAM_ACCEN1_EN62_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN1_Bits.EN62 */
#define IFX_DAM_ACCEN1_EN62_MSK (0x1u)

/** \brief Offset for Ifx_DAM_ACCEN1_Bits.EN62 */
#define IFX_DAM_ACCEN1_EN62_OFF (30u)

/** \brief Length for Ifx_DAM_ACCEN1_Bits.EN63 */
#define IFX_DAM_ACCEN1_EN63_LEN (1u)

/** \brief Mask for Ifx_DAM_ACCEN1_Bits.EN63 */
#define IFX_DAM_ACCEN1_EN63_MSK (0x1u)

/** \brief Offset for Ifx_DAM_ACCEN1_Bits.EN63 */
#define IFX_DAM_ACCEN1_EN63_OFF (31u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.ROM */
#define IFX_DAM_MEMCON_ROM_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.ROM */
#define IFX_DAM_MEMCON_ROM_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.ROM */
#define IFX_DAM_MEMCON_ROM_OFF (0u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.INTERR */
#define IFX_DAM_MEMCON_INTERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.INTERR */
#define IFX_DAM_MEMCON_INTERR_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.INTERR */
#define IFX_DAM_MEMCON_INTERR_OFF (2u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.RMWERR */
#define IFX_DAM_MEMCON_RMWERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.RMWERR */
#define IFX_DAM_MEMCON_RMWERR_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.RMWERR */
#define IFX_DAM_MEMCON_RMWERR_OFF (4u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.DATAERR */
#define IFX_DAM_MEMCON_DATAERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.DATAERR */
#define IFX_DAM_MEMCON_DATAERR_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.DATAERR */
#define IFX_DAM_MEMCON_DATAERR_OFF (6u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.ADDERR */
#define IFX_DAM_MEMCON_ADDERR_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.ADDERR */
#define IFX_DAM_MEMCON_ADDERR_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.ADDERR */
#define IFX_DAM_MEMCON_ADDERR_OFF (7u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.PMIC */
#define IFX_DAM_MEMCON_PMIC_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.PMIC */
#define IFX_DAM_MEMCON_PMIC_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.PMIC */
#define IFX_DAM_MEMCON_PMIC_OFF (8u)

/** \brief Length for Ifx_DAM_MEMCON_Bits.ERRDIS */
#define IFX_DAM_MEMCON_ERRDIS_LEN (1u)

/** \brief Mask for Ifx_DAM_MEMCON_Bits.ERRDIS */
#define IFX_DAM_MEMCON_ERRDIS_MSK (0x1u)

/** \brief Offset for Ifx_DAM_MEMCON_Bits.ERRDIS */
#define IFX_DAM_MEMCON_ERRDIS_OFF (9u)

/** \brief Length for Ifx_DAM_RGN_LA_Bits.ADDR */
#define IFX_DAM_RGN_LA_ADDR_LEN (27u)

/** \brief Mask for Ifx_DAM_RGN_LA_Bits.ADDR */
#define IFX_DAM_RGN_LA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_DAM_RGN_LA_Bits.ADDR */
#define IFX_DAM_RGN_LA_ADDR_OFF (5u)

/** \brief Length for Ifx_DAM_RGN_UA_Bits.ADDR */
#define IFX_DAM_RGN_UA_ADDR_LEN (27u)

/** \brief Mask for Ifx_DAM_RGN_UA_Bits.ADDR */
#define IFX_DAM_RGN_UA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_DAM_RGN_UA_Bits.ADDR */
#define IFX_DAM_RGN_UA_ADDR_OFF (5u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN0 */
#define IFX_DAM_RGN_ACCENA_EN0_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN0 */
#define IFX_DAM_RGN_ACCENA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN0 */
#define IFX_DAM_RGN_ACCENA_EN0_OFF (0u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN1 */
#define IFX_DAM_RGN_ACCENA_EN1_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN1 */
#define IFX_DAM_RGN_ACCENA_EN1_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN1 */
#define IFX_DAM_RGN_ACCENA_EN1_OFF (1u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN2 */
#define IFX_DAM_RGN_ACCENA_EN2_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN2 */
#define IFX_DAM_RGN_ACCENA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN2 */
#define IFX_DAM_RGN_ACCENA_EN2_OFF (2u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN3 */
#define IFX_DAM_RGN_ACCENA_EN3_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN3 */
#define IFX_DAM_RGN_ACCENA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN3 */
#define IFX_DAM_RGN_ACCENA_EN3_OFF (3u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN4 */
#define IFX_DAM_RGN_ACCENA_EN4_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN4 */
#define IFX_DAM_RGN_ACCENA_EN4_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN4 */
#define IFX_DAM_RGN_ACCENA_EN4_OFF (4u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN5 */
#define IFX_DAM_RGN_ACCENA_EN5_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN5 */
#define IFX_DAM_RGN_ACCENA_EN5_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN5 */
#define IFX_DAM_RGN_ACCENA_EN5_OFF (5u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN6 */
#define IFX_DAM_RGN_ACCENA_EN6_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN6 */
#define IFX_DAM_RGN_ACCENA_EN6_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN6 */
#define IFX_DAM_RGN_ACCENA_EN6_OFF (6u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN7 */
#define IFX_DAM_RGN_ACCENA_EN7_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN7 */
#define IFX_DAM_RGN_ACCENA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN7 */
#define IFX_DAM_RGN_ACCENA_EN7_OFF (7u)

/** \brief Length for Ifx_DAM_RGN_ACCENA_Bits.EN8 */
#define IFX_DAM_RGN_ACCENA_EN8_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENA_Bits.EN8 */
#define IFX_DAM_RGN_ACCENA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENA_Bits.EN8 */
#define IFX_DAM_RGN_ACCENA_EN8_OFF (8u)

