dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDam_bf.h
/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN52 */
#define IFX_DAM_RGN_ACCENB_EN52_OFF (20u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN53 */
#define IFX_DAM_RGN_ACCENB_EN53_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN53 */
#define IFX_DAM_RGN_ACCENB_EN53_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN53 */
#define IFX_DAM_RGN_ACCENB_EN53_OFF (21u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN54 */
#define IFX_DAM_RGN_ACCENB_EN54_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN54 */
#define IFX_DAM_RGN_ACCENB_EN54_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN54 */
#define IFX_DAM_RGN_ACCENB_EN54_OFF (22u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN55 */
#define IFX_DAM_RGN_ACCENB_EN55_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN55 */
#define IFX_DAM_RGN_ACCENB_EN55_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN55 */
#define IFX_DAM_RGN_ACCENB_EN55_OFF (23u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN56 */
#define IFX_DAM_RGN_ACCENB_EN56_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN56 */
#define IFX_DAM_RGN_ACCENB_EN56_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN56 */
#define IFX_DAM_RGN_ACCENB_EN56_OFF (24u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN57 */
#define IFX_DAM_RGN_ACCENB_EN57_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN57 */
#define IFX_DAM_RGN_ACCENB_EN57_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN57 */
#define IFX_DAM_RGN_ACCENB_EN57_OFF (25u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN58 */
#define IFX_DAM_RGN_ACCENB_EN58_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN58 */
#define IFX_DAM_RGN_ACCENB_EN58_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN58 */
#define IFX_DAM_RGN_ACCENB_EN58_OFF (26u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN59 */
#define IFX_DAM_RGN_ACCENB_EN59_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN59 */
#define IFX_DAM_RGN_ACCENB_EN59_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN59 */
#define IFX_DAM_RGN_ACCENB_EN59_OFF (27u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN60 */
#define IFX_DAM_RGN_ACCENB_EN60_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN60 */
#define IFX_DAM_RGN_ACCENB_EN60_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN60 */
#define IFX_DAM_RGN_ACCENB_EN60_OFF (28u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN61 */
#define IFX_DAM_RGN_ACCENB_EN61_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN61 */
#define IFX_DAM_RGN_ACCENB_EN61_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN61 */
#define IFX_DAM_RGN_ACCENB_EN61_OFF (29u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN62 */
#define IFX_DAM_RGN_ACCENB_EN62_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN62 */
#define IFX_DAM_RGN_ACCENB_EN62_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN62 */
#define IFX_DAM_RGN_ACCENB_EN62_OFF (30u)

/** \brief Length for Ifx_DAM_RGN_ACCENB_Bits.EN63 */
#define IFX_DAM_RGN_ACCENB_EN63_LEN (1u)

/** \brief Mask for Ifx_DAM_RGN_ACCENB_Bits.EN63 */
#define IFX_DAM_RGN_ACCENB_EN63_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGN_ACCENB_Bits.EN63 */
#define IFX_DAM_RGN_ACCENB_EN63_OFF (31u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN0 */
#define IFX_DAM_RGNACCEN_RA_EN0_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN0 */
#define IFX_DAM_RGNACCEN_RA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN0 */
#define IFX_DAM_RGNACCEN_RA_EN0_OFF (0u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN1 */
#define IFX_DAM_RGNACCEN_RA_EN1_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN1 */
#define IFX_DAM_RGNACCEN_RA_EN1_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN1 */
#define IFX_DAM_RGNACCEN_RA_EN1_OFF (1u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN2 */
#define IFX_DAM_RGNACCEN_RA_EN2_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN2 */
#define IFX_DAM_RGNACCEN_RA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN2 */
#define IFX_DAM_RGNACCEN_RA_EN2_OFF (2u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN3 */
#define IFX_DAM_RGNACCEN_RA_EN3_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN3 */
#define IFX_DAM_RGNACCEN_RA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN3 */
#define IFX_DAM_RGNACCEN_RA_EN3_OFF (3u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN4 */
#define IFX_DAM_RGNACCEN_RA_EN4_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN4 */
#define IFX_DAM_RGNACCEN_RA_EN4_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN4 */
#define IFX_DAM_RGNACCEN_RA_EN4_OFF (4u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN5 */
#define IFX_DAM_RGNACCEN_RA_EN5_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN5 */
#define IFX_DAM_RGNACCEN_RA_EN5_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN5 */
#define IFX_DAM_RGNACCEN_RA_EN5_OFF (5u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN6 */
#define IFX_DAM_RGNACCEN_RA_EN6_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN6 */
#define IFX_DAM_RGNACCEN_RA_EN6_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN6 */
#define IFX_DAM_RGNACCEN_RA_EN6_OFF (6u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN7 */
#define IFX_DAM_RGNACCEN_RA_EN7_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN7 */
#define IFX_DAM_RGNACCEN_RA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN7 */
#define IFX_DAM_RGNACCEN_RA_EN7_OFF (7u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN8 */
#define IFX_DAM_RGNACCEN_RA_EN8_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN8 */
#define IFX_DAM_RGNACCEN_RA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN8 */
#define IFX_DAM_RGNACCEN_RA_EN8_OFF (8u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN9 */
#define IFX_DAM_RGNACCEN_RA_EN9_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN9 */
#define IFX_DAM_RGNACCEN_RA_EN9_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN9 */
#define IFX_DAM_RGNACCEN_RA_EN9_OFF (9u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN10 */
#define IFX_DAM_RGNACCEN_RA_EN10_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN10 */
#define IFX_DAM_RGNACCEN_RA_EN10_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN10 */
#define IFX_DAM_RGNACCEN_RA_EN10_OFF (10u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN11 */
#define IFX_DAM_RGNACCEN_RA_EN11_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN11 */
#define IFX_DAM_RGNACCEN_RA_EN11_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN11 */
#define IFX_DAM_RGNACCEN_RA_EN11_OFF (11u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN12 */
#define IFX_DAM_RGNACCEN_RA_EN12_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN12 */
#define IFX_DAM_RGNACCEN_RA_EN12_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN12 */
#define IFX_DAM_RGNACCEN_RA_EN12_OFF (12u)

